Repository: hipay/hipay-fullservice-sdk-ios
Catalog: HiPayFullservice/Payment Screen/Resources/Localization/*.lproj/Payment-Screen.strings
Languages: it

# HPF_PAY_WITH_THIS_METHOD
source: Pay by %@
it: Paga con %@

# HPF_PAYMENT_REDIRECTION_DETAILS
source: You will be redirected to a secure page in order to complete your payment.
it: Sarai rediretto ad una pagina sicura per poter completare il pagamento.

# HPF_PAYMENT_APPLE_PAY_DETAILS
source: Purchase with Apple Pay simply by using Touch ID.
it: Acquista con Apple Pay semplicemente utilizzando Touch ID.

# HPF_PAYMENT_APPLE_PAY_ERROR
source: Failed to present in-app payment interface
it: Errore nel mostrare l'interfaccia di pagamento in-app

# HPF_PAYMENT_SCREEN_TITLE
source: Payment
it: Pagamento

# HPF_PAYMENT_CARDS_SCREEN_TITLE
source: Payment cards
it: Carte di pagamento

# HPF_TOTAL_AMOUNT
source: Total amount: %@
it: Importo totale: %@

# HPF_TAP_TO_DEFINE
source: Touch to define
it: Tocca per definire

# HPF_CANCEL
source: Cancel
it: Annulla

# HPF_YES
source: Yes
it: Si

# HPF_SETTINGS
source: Settings
it: Impostazioni

# HPF_PAY_BUTTON_TITLE
source: Pay
it: Paga

# HPF_ALERT_TRANSACTION_LOADING_TITLE
source: Transaction in progress
it: Transazione in corso

# HPF_ALERT_TRANSACTION_LOADING_MESSAGE
source: Your transaction is still being processed. Are you sure that you want to leave this screen?
it: La tua transazione è ancora in elaborazione. Sei sicuro di voler uscire da questa schermata?

# HPF_ALERT_TRANSACTION_LOADING_YES
source: Quit
it: Esci

# HPF_ALERT_TRANSACTION_LOADING_NO
source: Resume
it: Riprendi

# HPF_TRANSACTION_ERROR_DECLINED_TITLE
source: Transaction declined
it: Transazione declinata

# HPF_TRANSACTION_ERROR_DECLINED_MESSAGE
source: Please check your entries and try again.
it: Per favore controlla i dati inseriti e riprova di nuovo.

# HPF_TRANSACTION_ERROR_DECLINED_RESET_TITLE
source: Transaction declined
it: Transazione declinata

# HPF_TRANSACTION_ERROR_DECLINED_RESET_MESSAGE
source: Please use another payment method.
it: Per favore usa un altro metodo di pagamento.

# HPF_TRANSACTION_ERROR_OTHER_TITLE
source: Transaction declined
it: Transazione declinata

# HPF_TRANSACTION_ERROR_OTHER_MESSAGE
source: An error occurred while processing your transaction.
it: E' avvenuto un errore durante l'elaborazione della tua transazione.

# HPF_ERROR_HTTP_CLIENT_TITLE
source: An error occurred
it: Si è verificato un errore

# HPF_ERROR_HTTP_CLIENT_MESSAGE
source: Your request could not be completed.
it: La tua richiesta non può essere completata.

# HPF_ERROR_APPLE_PAY_TITLE
source: An error occurred
it: Si è verificato un errore

# HPF_ERROR_APPLE_PAY_MESSAGE
source: Your request could not be completed.
it: La tua richiesta non può essere completata.

# HPF_ERROR_NETWORK_UNAVAILABLE_TITLE
source: Network error
it: Errore di rete

# HPF_ERROR_NETWORK_UNAVAILABLE_MESSAGE
source: No Internet connection is available.
it: Nessuna connessione ad Internet disponibile.

# HPF_ERROR_NETWORK_OTHER_TITLE
source: Server error
it: Errore del server

# HPF_ERROR_NETWORK_OTHER_MESSAGE
source: Your request could not be completed.
it: La tua richiesta non può essere completata.

# HPF_ERROR_BUTTON_CANCEL
source: Cancel
it: Annulla

# HPF_ERROR_BUTTON_RETRY
source: Retry
it: Riprova

# HPF_CARD_HOLDER_LABEL
source: Card holder
it: Proprietario della carta

# HPF_CARD_HOLDER_PLACEHOLDER
source: Firstname and lastname
it: Nome e cognome

# HPF_CARD_NUMBER_LABEL
source: Number
it: Numero

# HPF_CARD_EXPIRATION_LABEL
source: Expiry date
it: Data di scadenza

# HPF_CARD_EXPIRATION_PLACEHOLDER
source: MM / YY
it: MM / AA

# HPF_CARD_SECURITY_CODE_DESCRIPTION_CVV
source: The CVV is the three-digit number on the back of your payment card.
it: Il codice CVV è un numero di 3 cifre stampato sul retro della tua carta.

# HPF_CARD_SECURITY_CODE_DESCRIPTION_CID
source: The CID is the four-digit number on the front of your American Express card.
it: Il codice CID è un numero di 4 cifre stampato sul fronte della tua carta American Express.

# HPF_CARD_SWITCH_STORE_DESCRIPTION
source: Store this card for future use
it: Memorizza questa carta per usi futuri

# HPF_CARD_STORE_DESCRIPTION
source: Store the card for future use
it: Memorizza questa carta per usi futuri

# HPF_CARD_STORE_TITLE
source: Payment card storing
it: Salvataggio della carta di pagamento

# HPF_CARD_SWITCH_TOUCHID_TITLE
source: Secure with Touch ID
it: Proteggi con Touch ID

# HPF_CARD_SWITCH_TOUCHID_DESCRIPTION
source: Would you like to activate Touch ID for securing future payments with this card? A fingerprint recognition will be required for further use.
it: Desideri attivare Touch ID per proteggere i tuoi futuri pagamenti con questa carta? Il riconoscimento biometrico sarà richiesto al prossimo utilizzo.

# HPF_CARD_STORED_SELECTION
source: Select a payment card
it: Seleziona una carta di pagamento

# HPF_CARD_STORED_TOUCHID_REASON
source: Unlock access to pay with this card
it: Sblocca l'accesso per pagare con questa carta

# HPF_CARD_STORED_TOUCHID_NOT_ACTIVATED_TITLE
source: An error occurred
it: Si è verificato un errore

# HPF_CARD_STORED_TOUCHID_NOT_ACTIVATED_MESSAGE
source: Please check that Touch ID is activated
it: Per favore verifica che Touch ID sia attivo

# HPF_CARD_STORED_ANOTHER_SELECTION
source: Another payment method
it: Altro metodo di pagamento

# HPF_FORWARD_VIEW_BACK
source: Back
it: Indietro

# HPF_FORWARD_VIEW_FORWARD
source: Forward
it: Avanti

# HPF_PAYMENT_PRODUCT_GROUP_PAYMENT_CARD
source: Card
it: Carta

# HPF_IDEAL_BANK
source: Bank
it: Banca

# HPF_QIWI_WALLET_USERNAME_LABEL
source: Phone number
it: Numero di telefono

# HPF_SEPA_DIRECT_DEBIT_FIRSTNAME
source: Firstname
it: Nome

# HPF_SEPA_DIRECT_DEBIT_LASTNAME
source: Lastname
it: Cognome
